app/Controllers/Auth.php

    public function login()
    {
        //load restaurants


        $restaurants_model = new RestaurantModel();
        $data['restaurants'] = $restaurants_model->select('id, name')->findAll();
---
SELECT `id`, `name`
FROM `restaurants`

        }

        $restaurants_model = new RestaurantModel();
        $restaurant_name = $restaurants_model
            ->select('name')
            ->find($user->id_restaurant)
            ->name;
---
SELECT `name`
FROM `restaurants`
WHERE `restaurants`.`id` = '1'